#+TITLE: พลังงานทดแทนในประเทศไทย
#+AUTHOR: สัปปินันทน์ เอกอำพน
#+DATE:
#+TODO: TODO | DONE
#+OPTIONS: title:nil toc:nil H:4 todo:t
#+OPTIONS: broken-links:t

#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: kaobook
#+LATEX_CLASS_OPTIONS: [a4paper,fontsize=10pt,twoside=true,fontmethod=modern,svgnames,openany]
# #+LATEX_HEADER: \setcounter{tocdepth}{1}
# #+LATEX_HEADER: \setcounter{secnumdepth}{0}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage{polyglossia}
#+LATEX_HEADER: \setdefaultlanguage{thai}
#+LATEX_HEADER: \setotherlanguage{english}
#+LATEX_HEADER: \usepackage{xltxtra}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \onehalfspacing
# #+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \XeTeXlinebreaklocale "th_TH"
# #+LATEX_HEADER: \XeTeXlinebreakskip = 0pt plus 1pt
#+LATEX_HEADER: \newfontfamily{\thaifont}[Script=Thai]{Laksaman}
#+LATEX_HEADER: \newfontfamily{\thaifontsf}[Script=Thai]{Laksaman}
#+LATEX_HEADER: \newfontfamily{\englishfont}{Libertinus Serif}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[american]{circuitikz}
#+LATEX_HEADER: \usetikzlibrary{arrows,calc,decorations,shapes,shapes.arrows,shapes.misc,positioning,decorations.pathmorphing,patterns}
#+LATEX_HEADER: \usepackage[american]{circuitikz}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \pgfplotsset{compat=1.18}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{epigraph}
#+LATEX_HEADER: \usepackage{mhchem}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue}
# #+LATEX_HEADER: \usepackage{mparhack} % to put margin figures on the correct side

#+BIBLIOGRAPHY: solar-book.bib
#+CITE_EXPORT: csl ieee.csl
#+LATEX_HEADER: \usepackage[style=numeric,backend=biber,language=english,autolang=other]{biblatex}
# #+LATEX_HEADER: \addbibresource{solar-org-book.bib}
# #+LATEX_HEADER: \NewBibliographyString{august}
# #+LATEX_HEADER: \NewBibliographyString{in}
**** Solution
จากสมการ [[eq:orgb7bf346]] เราจะสามารถคำนวณหาค่าความต่างศักย์ที่สร้างกระแสไฟฟ้าสูงสุด
$P_{\max P}$ ได้ดังนี้

#+BEGIN_SRC python :exports none :session solar-ex-1
from sympy import nsolve, exp
from sympy.abc import x

I = 250
I_pv = 0.3*I
I_0 = 1e-8
C = 1.6e-19
k = 1.38e-23
T = 50 + 273

V_max = nsolve(exp(C*x/(k*T)) - (1 + I_pv/I_0)/(1 + C*x/(k*T)), x, 0.6)

P_max = V_max*(I_0 + I_pv)/(1 + k*T/(C*sol))

eff = P_max/I
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session solar-ex-1 :results output :exports none
print ("V_{{\\\max}} &= {0:.3f} \\\\text{{ V}}".format(V_max))
#+END_SRC

#+NAME: duh
#+RESULTS:
: V_{\\max} &= 0.549 \\text{ V}

#+BEGIN_SRC latex :exports results :var input=duh
\begin{align*}
  \exp \left(\frac{e V_{\max P}}{kT} \right) &= \dfrac{1+\dfrac{i_{PV}}{i_0}}{1+ \dfrac{e V_{\max P}}{kT}} \\
  \exp \left(\frac{ 1.6 \times 10^{-19} V_{\max P} }{ 1.38 \times 10^{-23} \times (50 + 273)} \right) &= \dfrac{1+ \dfrac{0.3 \times 250}{10^{-8}}}{1+\dfrac{1.6 \times 10^{-19} V_{\max P}}{1.38 \times 10^{-23} \times (50 + 273)}} \\
  input
\end{align*}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{align*}
  \exp \left(\frac{e V_{\max P}}{kT} \right) &= \dfrac{1+\dfrac{i_{PV}}{i_0}}{1+ \dfrac{e V_{\max P}}{kT}} \\
  \exp \left(\frac{ 1.6 \times 10^{-19} V_{\max P} }{ 1.38 \times 10^{-23} \times (50 + 273)} \right) &= \dfrac{1+ \dfrac{0.3 \times 250}{10^{-8}}}{1+\dfrac{1.6 \times 10^{-19} V_{\max P}}{1.38 \times 10^{-23} \times (50 + 273)}} \\
  V_{\max} &= 0.549 \text{ V}
\end{align*}
#+end_export

เมื่อคำนวณ $V_{\max P}$
ได้แล้วเราจะสามารถคำนวณหากำลังไฟฟ้าสูงสุดที่จะสามารถสร้างได้เท่ากับ

#+BEGIN_SRC python :results output :session solar-ex-1 :exports none
print ("P_{{\\\max}} &= {0:.3f} \\\\text{{ W}}".format(P_max))
#+END_SRC

#+NAME: duh2
#+RESULTS:
: P_{\\max} &= 39.189 \\text{ W}

#+BEGIN_SRC latex :exports results :var input=duh2
\begin{align*}
    P_{\max} &=  \dfrac{V_{\max P} ( i_0 + i_{PV} )}{1 + \dfrac{kT}{e V_{\max P}}} \\
             &= \dfrac{0.549 \left(10^{-8} + 75\right)}{1 + \dfrac{ 1.38 \times 10^{-23} (50 + 273)}{1.6 \times 10^{-19} (0.549)}} \\
             input
  \end{align*}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{align*}
    P_{\max} &=  \dfrac{V_{\max P} ( i_0 + i_{PV} )}{1 + \dfrac{kT}{e V_{\max P}}} \\
             &= \dfrac{0.549 \left(10^{-8} + 75\right)}{1 + \dfrac{ 1.38 \times 10^{-23} (50 + 273)}{1.6 \times 10^{-19} (0.549)}} \\
             P_{\max} &= 39.189 \text{ W}
  \end{align*}
#+end_export

ประสิทธิภาพของแผงเซลล์แสงอาทิตย์สามารถคำนวณได้จากกำลังไฟฟ้าที่ผลิตได้หารด้วยกำลังของรังสีแสงอาทิตย์ที่ตกกระทบบนแผง

#+BEGIN_SRC python :results output :session solar-ex-1 :exports none
print('&= \\\\frac{' + str(round(P_max,3)) + '}{' + str(I) + '} \\\\\\\\')
print('&= {0:.3f}'.format(eff))
#+END_SRC

#+NAME: duh3
#+RESULTS:
: &= \\frac{39.189}{250} \\\\
: &= 0.157

#+BEGIN_SRC latex :exports results :var input=duh3
\begin{align*}
  \eta &= \frac{P_{\max}}{I_{rad}} \\
       input
\end{align*}
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{align*}
  \eta &= \frac{P_{\max}}{I_{rad}} \\
       &= \frac{39.189}{250} \\
&= 0.157
\end{align*}
#+end_export

***** วิธีทำ: แผงรับแสงอาทิตย์ที่ตั้งที่จ.ขอนแก่น

เริ่มจากการคำนวณอัตราการไหลแบบไร้มิติ
\begin{align*}
  \frac{\dot{m}C_{p}}{A_{c}U_{L}F′} &= \frac{0.03(4190)}{2(8)(0.841)} = 9.35
\end{align*}

เราสามารถหาค่า collector flow factor ได้จาก
\begin{align*}
  F″ &= 9.35 \left[ 1 - \exp \left( - \frac{1}{9.35} \right) \right] \\
                   &= 0.948
\end{align*}

อัตราการดึงความร้อนจากแผง ($F_R$) สามารถคำนวณได้จาก
\begin{align*}
  F_{R} &= F′F″ = 0.841(0.948) = 0.797
\end{align*}

จากนั้น เราสามารถหาอัตราการสูญเสียความร้อนในช่วง 10:00 - 11:00 โดยกำหนดค่าอุณหภูมิของน้ำขาเข้าเป็น 40 C ได้ว่า
\begin{align*}
  q_{loss} = U_{L}(T_{fi} - T_{a}) = 8(40 - 37)(3600) = 8.64 \times 10^{4} \text{ J/m}^{2}\text{h}
\end{align*}

จากการคำนวณโดยใช้ spreadsheet พลังงานแสงอาทิตย์ที่ตกกระทบลงบนแผ่นในช่วง 10:00 - 11:00 มีค่า 3.95 MJ/m$^2$ ดังนั้น ค่าความร้อนเพิ่มที่ใช้ประโยชน์ได้จากมีค่าเท่ากับ
\begin{align*}
  q_{u} &= F_R(S - q_{loss}) = 0.797(0.8(395) - 8.64) \times 10^{4} = 245  \times 10^4 \text{ J/m}^{2}\text{h}
\end{align*}

ประสิทธิภาพของแผงรับแสงอาทิตย์ในช่วงเวลา 10:00 - 11:00 เท่ากับ
\begin{align*}
  \eta &= \frac{Q_{u}}{I_{T}A_{C}} = \frac{q_{u}}{I_{T}} = \frac{2.45}{3.95} \\
       &= 0.62
\end{align*}

เราสามารถนำผลการคำนวณในแต่ละชั่วโมงตั้งแต่ 6:00 - 18:00 มาแสดงในตารางได้ดังนี้
#+ATTR_LATEX: :align crccccc :booktabs t
|  Time | $T_a$ | $I_T$ | $q_{loss}$ | $q_u$ | $\eta$ |
|-------+-------+-------+------------+-------+--------|
|     6 |    28 |  0.00 |       0.35 |  0.00 |   0.00 |
|     7 |    29 |  0.23 |       0.32 |  0.00 |   0.00 |
|     8 |    30 |  0.94 |       0.29 |  0.37 |   0.39 |
|     9 |    32 |  1.52 |       0.23 |  0.79 |   0.52 |
|    10 |    35 |  3.05 |       0.14 |  1.83 |   0.60 |
|    11 |    37 |  3.95 |       0.09 |  2.45 |   0.62 |
|    12 |    38 |  4.44 |       0.06 |  2.79 |   0.63 |
|    13 |    38 |  4.39 |       0.06 |  2.76 |   0.63 |
|    14 |    37 |  3.82 |       0.09 |  2.37 |   0.62 |
|    15 |    35 |  2.87 |       0.14 |  1.72 |   0.60 |
|    16 |    34 |  1.79 |       0.17 |  1.00 |   0.56 |
|    17 |    33 |  0.87 |       0.20 |  0.39 |   0.45 |
|    18 |    32 |  0.23 |       0.23 |  0.00 |   0.00 |
|-------+-------+-------+------------+-------+--------|
| Total |       |       |            | 16.47 |        |
#+TBLFM: @15$5=vsum(@2..@14)

**** เฉลย: การวิเคราะห์เทอร์โมอิเลกทริก
#+BEGIN_SRC python :results none :exports none :session nerd
T_H = 200
T_L = 50
S_p = 300e-6
S_n = -100e-6
rho_p = 9e-6
rho_n = 1e-5
kappa_p = 1.2
kappa_n = 1.4
L = 4e-3
A = 16e-6
S_pn = S_p - S_n
R_p = rho_p * L / A
R_n = rho_n * L / A
K_p = kappa_p * A / L
K_n = kappa_n * A / L
R_teg = R_p + R_n
K_teg = K_p + K_n

Z = S_pn**2 / (K_teg * R_teg)
P_max = S_pn**2 * (T_H - T_L)**2 /4/R_teg
eff = (T_H - T_L)/(2*T_H + 2/Z - (T_H - T_L)/2)
#+END_SRC

1. ค่า $Z$ สามารถคำนวณได้จากสมการ
   $Z = \dfrac{S_{pn}^2}{K_{teg} R_{teg}}$

   #+BEGIN_SRC python :results output raw :exports results :session nerd
print('#+BEGIN_EXPORT latex')
print('\\begin{align*}')
print('S_{pn} &= S_p - S_n =' + str(S_p) + '- (' + str(S_n) + ') \\\\')
print('&= ' + str(round(S_pn,5)) + '\\\\')
print('K_{teg} &= K_p + K_n = \\frac{\\kappa_p A}{L} + \\frac{\\kappa_n A}{L} \\\\')
print('&= \\frac{ \\num{' + str(A) + '}}{ \\num{' + '{0:.2e}'.format(L) + '}} \\left(' + str(kappa_p) + '+' + str(kappa_n) + '\\right) \\\\')
print('&=' + str(K_teg) + '\\\\')
print('R_{teg} &= R_p + R_n = \\frac{\\rho_p L}{A} + \\frac{\\rho_n L}{A} \\\\')
print('&= \\frac{' + str(L) + '}{' + str(A) + '} \\left(\\num{' + str(kappa_p) + '}+\\num{' + str(kappa_n) + '}\\right) \\\\')
print('&=' + str(round(R_teg,5)) + '\\\\')
print('Z &= \\frac{Z^2}{K_{teg}R_{teg}} \\\\')
print('&=' + str(round(Z,5)))
print('\\end{align*}')
print('#+END_EXPORT')
    #+END_SRC

    #+RESULTS:
    #+BEGIN_EXPORT latex
    \begin{align*}
    S_{pn} &= S_p - S_n =0.0003- (-0.0001) \\
    &= 0.0004\\
    K_{teg} &= K_p + K_n = \frac{\kappa_p A}{L} + \frac{\kappa_n A}{L} \\
    &= \frac{ \num{1.6e-05}}{ \num{4.00e-03}} \left(1.2+1.4\right) \\
    &=0.0104\\
    R_{teg} &= R_p + R_n = \frac{\rho_p L}{A} + \frac{\rho_n L}{A} \\
    &= \frac{0.004}{1.6e-05} \left(\num{1.2}+\num{1.4}\right) \\
    &=0.00475\\
    Z &= \frac{Z^2}{K_{teg}R_{teg}} \\
    &=0.00324
    \end{align*}
    #+END_EXPORT

2. กำลังสูงสุดที่ TEG สามารถผลิตได้มาจากการ load matching โดยการใช้
   $R_L = R_{teg}$

   #+BEGIN_SRC python :results output raw :exports results :session nerd
print('\\begin{align*}')
print('P_L &= i V_L \\\\')
print('&= i \\left( S_{pn} \\Delta T - i^2 R_{teg} \\right) \\\\')
print('&= \\frac{S_{pn} \\Delta T}{2 R_{teg}} \\left( S_{pn} \\Delta T -  \\frac{S_{pn} \\Delta T}{2 R_{teg}} R_{teg} \\right) \\\\')
print('&= \\frac{ S_{pn}^2 \\Delta T^2 }{4 R_{teg}} \\\\')
print('&= \\frac{' + str(round(S_pn,5)) + '^2 (200 - 50)^2}{4 (' + str(round(R_teg,5)) + ')} \\\\')
print('&=\\num{' + '{0:.2e}'.format(P_max) + '}')
print('\\end{align*}')
    #+END_SRC

    #+RESULTS:
    \begin{align*}
    P_L &= i V_L \\
    &= i \left( S_{pn} \Delta T - i^2 R_{teg} \right) \\
    &= \frac{S_{pn} \Delta T}{2 R_{teg}} \left( S_{pn} \Delta T -  \frac{S_{pn} \Delta T}{2 R_{teg}} R_{teg} \right) \\
    &= \frac{ S_{pn}^2 \Delta T^2 }{4 R_{teg}} \\
    &= \frac{0.0004^2 (200 - 50)^2}{4 (0.00475)} \\
    &=\num{1.89e-01}
    \end{align*}

3. ประสิทธิภาพของ TEG สามารถคำนวณได้จากสมการ
   [[eq:orga596609]]

   #+BEGIN_SRC python :results output raw :exports results :session nerd
print('\\begin{align*}')
print('\\eta &= \\frac{ \\Delta T }{ 2 T_H + \\dfrac{2}{Z} - \\dfrac{ \\Delta T }{ 2 } } \\\\')
print('&= \\frac{' + str(T_H) + '-' + str(T_L) + '}{ 2(' + str(T_H) + ' + \\frac{2}{' + str(round(Z,5)) + '} + \\frac{' + str(T_H) + '-' + str(T_L) + '}{2}} \\\\')
print('&=' + '{0:.3f}'.format(eff))
print('\\end{align*}')
   #+END_SRC

   #+RESULTS:
   \begin{align*}
   \eta &= \frac{ \Delta T }{ 2 T_H + \dfrac{2}{Z} - \dfrac{ \Delta T }{ 2 } } \\
   &= \frac{200-50}{ 2(473 + \frac{2}{0.00324} + \frac{200-50}{2}} \\
   &= 0.072
   \end{align*}

**** การออกแบบล้อตุนกำลังสำหรับรถโดยสารประจำทาง

เราต้องการจะออกแบบล้อตุนกำลังสำหรับรถประจำทางเพื่อใช้ในการชาร์จไฟระหว่างจอดรับผู้โดยสาร
และขับเคลื่อนรถในช่วงออกตัว เพื่อให้รับพลังงานได้ 50 kJ มีวัสดุให้เลือก
4 วัสดุซึ่งมีคุณสมบัติดังต่อไปนี้

#+ATTR_LATEX: :booktabs t :align lrp{3cm}
#+CAPTION: คุณสมบัติของวัสดุสำหรับออกแบบล้อตุนกำลัง
| Material            | Density (kg/m$^{\text{3}}$) | Ultimate Tensile Strength (MPa) |
|---------------------+-----------------------------+---------------------------------|
| CFRP                |                        1500 |                             550 |
| High strength steel |                        7800 |                            1500 |
| Cast Iron           |                        7300 |                             200 |

การออกแบบล้อตุนกำลังสามารถทำได้โดยใช้สมการคำนวณพลังงานจลน์และความเค้นดังนี้
\begin{gather*}
  E = \frac{1}{2} J \omega^2 \\
  J = \frac{1}{2} m r^2 \\
  \sigma_t = \rho r^2 \omega^2
\end{gather*}
ซึ่งจากการวิเคราะห์สมการ
หากเรากำหนดให้ล้อตุนกำลังจากทุกวัสดุใช้ความหนา $t$ เท่ากัน
เราจะสามารถคำนวณรัศมีและมวลของล้อได้ดังนี้

\begin{gather*}
  E = \frac{1}{4} m r^2 \omega^2 \\
  r^2 \omega^2 = \frac{\sigma_t}{\rho} \\
  E = \frac{1}{4} m \frac{\sigma_t}{\rho} \\
  m = \rho \pi r^2 t \\
  r = \sqrt{ \frac{4E}{\pi t \sigma_t}}
\end{gather*}

เมื่อแก้สมการหาค่ารัศมีโดยกำหนดให้ความเค้นมากที่สุดของล้อกำลัง
$\sigma_t = S_{ut}$ จะได้มวลและรัศมีของล้อตุนกำลังจากวัสดุต่างๆดังนี้

#+BEGIN_SRC python :exports results :results output raw :session flywheel-ex-1
import math

E_carbon = 10e9
E_steel = 210e9
E_iron = 210e9
rho_carbon = 1500
rho_steel = 7800
rho_iron = 7300
S_carbon = 550e6
S_steel = 1500e6
S_iron = 200e6

thickness = 5e-2

Energy = 50e3

r_carbon = math.sqrt(4*Energy/math.pi/thickness/S_carbon)
r_steel = math.sqrt(4*Energy/math.pi/thickness/S_steel)
r_iron = math.sqrt(4*Energy/math.pi/thickness/S_iron)

m_carbon = rho_carbon*math.pi*r_carbon**2*thickness
m_steel = rho_steel*math.pi*r_steel**2*thickness
m_iron = rho_iron*math.pi*r_iron**2*thickness

print("#+ATTR_LATEX: :booktabs t")
print("| Material | Radius (m) | Mass (kg) |")
print("|-")
print('| CFRP | {0:.3f} | {1:.3f} |'.format(r_carbon, m_carbon))
print('| HSS | {0:.3f} | {1:.3f} |'.format(r_steel, m_steel))
print('| Cast Iron | {0:.3f} | {1:.3f} |'.format(r_iron, m_iron))
#+END_SRC

#+RESULTS:
#+ATTR_LATEX: :booktabs t
| Material | Radius (m) | Mass (kg) |
|-
| CFRP | 0.048 | 0.545 |
| HSS | 0.029 | 1.040 |
| Cast Iron | 0.080 | 7.300 |

ซึ่งจะเห็นได้ว่า CFRP ให้ล้อตุนกำลังที่มีมวลเบาที่สุด
เนื่องจากอัตราส่วนความแข็งแรงจำเพาะสูงที่สุด
แต่หากมีข้อจำกัดเรื่องของขนาด ล้อที่ทำจาก HSS มีรัศมีน้อยที่สุด

